/*
Đề bài: Tạo bảng cửu chương từ 1 -> 10

1 x 1 = 1   |   2 x 1 = 2   |   3 x 1 = 3
1 x 2 = 2   |   2 x 2 = 4   |   3 x 2 = 6
1 x 3 = 3   |   2 x 3 = 6   |   3 x 3 = 9
...         |   ...         |   ...
1 x 10 = 10 |   2 x 10 = 20 |   3 x 10 = 30


Logic:
Ta thấy cần 2 vòng lặp
 - Vòng lặp ngoài cho các số từ 1 -> 10 (chiều ngang - số hàng)
 - Vòng lặp trong để nhân với các số từ 1 -> 10 (chiều dọc - số cột)


Sơ đồ khối:




                                                      ┌──────────────────────────────────┐
                                                      │                                  │
                                                      │                                  │
                                                      │    Khoi tao bien:                │
                                                      │                                  │
                                                      │         i: so hang dau tien      │
                                                      │         j: so hang thu hai       │
                                                      │                                  │
                                                      │    ────────────────────────      │
                                                      │                           │
                                                      │                                  │
                                                      │                                  │
                                                      └────────────────┬─────────────────┘
                                                                       │
                                                                       │
                                                                       │
                                                                       ▼
                                                                ┌────────────┐
                                                                │            │
                                                                │    i = 1   │
                                                                │            │
                                                                └──────┬─────┘
                                                                       │
                                                                       │
                                                                       │
                                                                       │
                                                                       ▼
                                                       ┌──────────────────────────────┐
                                                       │                              │
     ┌─────────────────────────┐                       │                              │                       ┌────────────┐
     │                         │         false         │   Dieu kien / pham vi cua i: │     true              │            │
     │  ket thuc chuong trinh  │   ◄─────────────────  │                              │ ────────────────────► │    j = 1   │
     │                         │     thoat vong lap    │                              │                       │            │
     └─────────────────┬───────┘     so hang thu 1     │          i <= 10             │                       └──────┬─────┘
                                                       │                              │                              │
                                                       └──────────────────────────────┘                              │
                                                                                                                     │
                                                             ▲                                                       │
                                                             │                                                       │
                                                             │                                                       ▼
                                                             │                                       ┌──────────────────────────────┐                       ┌──────────────────────────┐
                                                             │                                       │                              │                       │                          │              ┌─────────────────┐
                                                       ┌─────┴──────┐                                │                              │                       │    In ra:                │              │                 │
                                                       │            │               false            │   Dieu kien / pham vi cua j: │     true              │    ───────────────────── │ ───────────► │    j = j + 1    │
                                                       │ i = i + 1  │  ◄──────────────────────────── │                              │ ────────────────────► │                          │              │                 │
                                                       │            │           thoat vong lap       │                              │                       │    i x j = i*j           │              └──────┬──────────┘
                                                       └──────┬─────┘           so hang thu 2        │          j <= 10             │                       │                          │                     │
                                                                                                     │                              │                       └──────────────────────────┘                     │
                                                                                                     └──────────────────────────────┘                                                                        │
                                                                                                                                                                                                             │
                                                                                                                  ▲                                                                                          │
                                                                                                                  │                                                                                          │
                                                                                                                  │                                                                                          │
                                                                                                                  │                                        quay lai vong lap                                 │
                                                                                                                  └──────────────────────────────────────────────────────────────────────────────────────────┘











 */


console.log("Bảng cửu chương từ 1 -> 10")

let i   //Số hạng đầu tiên
let j   //Số hạng thứ 2

for (let i = 1; i <= 10; i++) {
    console.log(`Bảng cửu chương ${i}:`)
    for (let j = 1; j <= 10; j++) {
        console.log(`${i} x ${j} = ${i*j}`)
    }
    console.log(`------------------------`)
}