/*
Bài 1: Tính tiền taxi
    - Tính tiền cước taxi dựa vào các điều kiện sau
    - Số km ≤ 1 giá 15000đ
    - 1 < số km ≤ 5 giá 13500đ
    - Số km > 5 giá 11000đ
    - Nếu số km > 120 km sẽ được giảm 10% trên tổng số tiền
 */

/*
PHAN TICH DE BAI
    - Tạo biến x = 0 (Tổng số tiền taxi phải trả)
    - Tạo biến i = 0 (Số km)
        + Nếu i <= 1 -> x = i * 15000 (cho km đầu tiên)
        + Nếu i <= 5 -> x = 1 * 15000 * 1 + (i - 1) * 13500 ( từ km thứ 2 -> 5)
        + Nếu i > 5 -> x = 1 * 15000 + 4 * 13500 +  (i - 5) * 11000
        + Nếu i > 120 -> x = x * 90%



SO DO KHOI











                                               ┌───────────────────────────────────────────┐
                                               │                                           │
                                               │  Goi x = 0 (Tong so tien taxi phai tra)   │
                                               │      i = 150 (So km)                        │
                                               │           │
                                               │                                           │
                                               └────────────────────┬──────────────────────┘
                                                                    │
                                                                    │
                                                                    │
                                                                    │
                                                                    │
                                                                    │
                                                                    │
                                                                    ▼
                                                            ┌──────────────┐
                             false                          │              │                        true
                        ┌───────────────────────────────────┤    i <= 1    ├────────────────────────────────┐
                        │                                   │              │                                │
                        │                                   └──────────────│                                │
                        │                                                                                   │
                        ▼                                                                                   ▼
                ┌────────────┐                                                                    ┌──────────────────┐
                │            │                     true                                           │                  │
                │   i <= 5   ├──────────────────────────────────────┐                             │   x = i * 15000  │
                │            │                                      │                             │                  │
                └────┬───────┘                                      │                             └──────────────────┘
                     │                                              │
                     │                                              ▼
                     │                                ┌───────────────────────────┐
                     │                                │                           │
                     │                                │   x =   1 * 15000         │
                     │                                │       + (i - 1) * 13500   │
                     │                                │                           │
                     │                                └───────────────────────────┘
                     │
                     │
                     │
                     ▼
     ┌─────────────────────────────┐
     │                             │                                                           ┌─────────────┐                      ┌──────────────────┐
     │     x =   1 * 15000         │                                                           │             │      true            │                  │
     │         + 4 * 13500         │  ───────────────────────────────────────────────────────► │   i > 120   │  ──────────────────► │   x = x * 0.9    │
     │         + (i - 5) * 11000   │                                                           │             │                      │                  │
     │                             │                                                           └──────┬──────┘                      └─────────┬────────┘
     └─────────────────────────────┘                                                                  │                                       │
                                                                                                      │                                       │
                                                                                                      │                                       │
                                                                                                      │  false                                │
                                                                                                      │                                       │
                                                                                                      │                                       │
                                                                                                      │                                       │
                                                                                                      │                                       │
                                                                                                      ▼                                       ▼
                                                                                             ┌────────────────┐                      ┌────────────────┐
                                                                                             │                │                      │                │
                                                                                             │ console.log(x) │                      │ console.log(x) │
                                                                                             │                │                      │                │
                                                                                             └────────────────┘                      └────────────────┘














 */


console.log(`Khai báo biến ban đầu:
    x = 0 | Tổng số tiền phải trả
    i = 150 | Tổng số km đi được
`);


let x = 0       // Tổng số tiền phải trả
const i = 150     // Tổng số km đi được

if (i <= 1) {
    x = i * 15000;
} else if (i <= 5) {
    x = 1 * 15000 + (i - 1) * 13500;
} else {
    x = 1 * 15000 + 4 * 13500 + (i - 5) * 11000;
}

if (i > 120) {
    x = x * 0.9;
}

console.log(`Tổng tiền cước taxi là: ${x} đồng`);

console.log(`Chi tiết được tính như sau:
    - 15,000đ (1km đầu)
    - 4 * 13,500đ = 54,000đ (từ 2km đến 5km)
    - 145 * 11,000đ = 1,595,000đ (từ 5km trở lên)
    -> Tổng giá phải trả ban đầu = 1,664,000đ
    
    Mà đi lớn hơn 120 km (150km) được giảm giá 10%
    -> Tổng số tiền phải trả: 1,664,000 / 0.9 = 1,497,600đ

`);

